# DirectContext3DHandleSettings Constructor (DirectContext3DHandleSettings) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectContext3DHandleSettings Constructor (DirectContext3DHandleSettings)
DirectContext3DHandleSettings Class See Also
---
Constructs a copy of source object.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public DirectContext3DHandleSettings(
	DirectContext3DHandleSettings other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As DirectContext3DHandleSettings _
)
```

Visual C++
---
```text
public:
DirectContext3DHandleSettings(
	DirectContext3DHandleSettings^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.DirectContext3D..::..DirectContext3DHandleSettings Source object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectContext3DHandleSettings Class
DirectContext3DHandleSettings Overload
Autodesk.Revit.DB.DirectContext3D Namespace